# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, F4v2, [128]],
   [-1, 1, nn.AvgPool2d, [2, 2, 0]],
   [-1, 1, Conv, [256, 3, 1]],  # 4-P3/8
   [-1, 6, F4v2, [256]],
   [-1, 1, nn.AvgPool2d, [2, 2, 0]],
   [-1, 1, Conv, [512, 3, 1]],  # 7-P4/16
   [-1, 9, F4v2, [512]],
   [-1, 1, nn.AvgPool2d, [2, 2, 0]],
   [-1, 1, Conv, [1024, 3, 1]],  # 10-P5/32
   [-1, 3, F4v2, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 12
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, F4v2, [512, False]],  # 16

   [-1, 1, Conv, [256, 1, 1]], # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, F4v2, [256, False]],  # 20 (P3/8-small)

   [-1, 1, nn.AvgPool2d, [2, 2, 0]],
   [-1, 1, Conv, [256, 3, 1]], # 22
   [[-1, 17], 1, Concat, [1]],  # cat head P4
   [-1, 3, F4v2, [512, False]],  # 24 (P4/16-medium)
   
   [-1, 1, nn.AvgPool2d, [2, 2, 0]],
   [-1, 1, Conv, [512, 3, 1]], # 26
   [[-1, 13], 1, Concat, [1]],  # cat head P5
   [-1, 3, F4v2, [1024, False]],  # 28 (P5/32-large)

  #  [20, 1, eSE, [256]],
  #  [24, 1, eSE, [512]],
  #  [28, 1, eSE, [1024]],

  #  [[29, 30, 31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  [[20, 24, 28], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
